---
kind: type
id: T:Autodesk.Revit.DB.Structure.WireDistributionDirection
source: html/2c5558b4-57d4-1b81-e843-e79c5c1bbc21.htm
---
# Autodesk.Revit.DB.Structure.WireDistributionDirection

Defines the direction of the distribution of wires in a Fabric Sheet.

## Syntax (C#)
```csharp
public enum WireDistributionDirection
```